In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\aojha\onedrive\attachments\python\venv\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\aojha\onedrive\attachments\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\aojha\onedrive\attachments\python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.5 MB 11.8 MB/s eta 0:00:01
   ------------ --------------------------- 3.7/11.5 MB 9.5 MB/s eta 0:00:01
   ------------------ --------------------- 5.2/11.5 MB 8.6 MB/s eta 0:00:01
   --------------------- ------------------ 6.3/11.5 MB 7.4 MB/s eta 0:00:01
   ------------------------ --------------- 7.1/11.5 MB 6.9 MB/s eta 0:00:01
   ------------------------------ --------- 8.7/11.5 MB 6.9 MB/s eta 0:00:01
   ---------------------------------- ----- 10.0/11.5 MB 6.8 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 6.9 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 6.7 MB/s eta 0:00:00
Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [2]:
import pandas as pd

In [7]:
import pandas as pd 
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [11]:
data=[10,20,30]
index=['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [13]:
##data frame
data={
   'Name':['Krish','John','Jack'],
   'Age':[25,30,45],
   'City':['Banglaore','New delhi','Hangkon'] 
}

df=pd.DataFrame(data)

print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Banglaore
1   John   30  New delhi
2   Jack   45    Hangkon
<class 'pandas.core.frame.DataFrame'>

In [14]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglaore'],
       ['John', 30, 'New delhi'],
       ['Jack', 45, 'Hangkon']], dtype=object)

In [17]:
data=[
   {'Name':'Krish','Age':32,'City':'Bangalore'},
   {'Name':'John','Age':34,'City':'Bdelhi'},
   {'Name':'Krh','Age':3,'City':'Bangore'},
   {'Name':'Krh','Age':2,'City':'galore'}

   
]

df=pd.DataFrame(data)

print(df)

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Bdelhi
2    Krh    3    Bangore
3    Krh    2     galore

In [19]:
df.loc[0]
df.iloc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [20]:
df.loc[0][0]

C:\Users\aojha\AppData\Local\Temp\ipykernel_10016\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [23]:
df.iat[2,2]

'Bangore'

In [22]:
df.at[2,'Age']

np.int64(3)

In [24]:
#data manipulation with dataframe

df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Bdelhi
2    Krh    3    Bangore
3    Krh    2     galore

In [26]:
df['Salary']=[50000,60000,70000,80000]
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34     Bdelhi   60000
2    Krh    3    Bangore   70000
3    Krh    2     galore   80000

In [30]:
df.drop('Salary',axis=1,inplace=True)

In [31]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34     Bdelhi
2    Krh    3    Bangore
3    Krh    2     galore

In [34]:
df['Age']=df['Age']+1

df.drop(0)

   Name  Age     City
1  John   37   Bdelhi
2   Krh    6  Bangore
3   Krh    5   galore